In [1]:
import pandas as pd

In [2]:
dict11 = {"name" : ["ineuron", "ankita", "abhishek", "raman"],
       "number" : [12,55,87,26],
       "test" : ["xyz", "bien","wien", "ABC"],
       "string" : ["dhjfbshj", "honey", "regarder", "returned"]}

dict12 = {"name" : ["surya", "sudhesh", "manish", "lovely"],
       "number" : [14,65,77,6],
       "test" : ["xyz", "bien","wien", "ABC"],
       "string" : ["djkfdfaa", "detail", "onus", "returned"]}

dict13 = {"name" : ["ineuron13", "ankita13", "abhishek13", "raman13"],
       "number" : [12,55,87,26],
       "test" : ["xyz13", "bien13","wien13", "ABC13"]}

dict14 = {"name" : ["ineuron", "manish", "abhishek", "lovely"],
       "number" : [12,66,87,26],
       "test" : ["xyz", "bien","wien", "ABC"],
       "string" : ["dhjfbshj", "honey", "regarder", "returned"]}

dict15 = {"name1" : ["ineuron", "ankita13", "abhishek", "raman13"],
       "number" : [12,55,87,26],
       "test" : ["xyz13", "bien13","wien13", "ABC13"]}

dict16 = {"name1" : ["ineuron", "ankita13", "abhishek", "raman13"],
       "number1" : [12,55,87,26],
       "test1" : ["xyz13", "bien13","wien13", "ABC13"]}

In [11]:
df1 = pd.DataFrame(dict11)
df2 = pd.DataFrame(dict12)
df3 = pd.DataFrame(dict13)
df6 = pd.DataFrame(dict14)
df7 = pd.DataFrame(dict15)
df8 = pd.DataFrame(dict16)
df9 = pd.DataFrame(dict16, index=[4,5,6,7])

In [4]:
display("Table df1",df1)
display("Table df2", df2)

'Table df1'

       name  number  test    string
0   ineuron      12   xyz  dhjfbshj
1    ankita      55  bien     honey
2  abhishek      87  wien  regarder
3     raman      26   ABC  returned

'Table df2'

      name  number  test    string
0    surya      14   xyz  djkfdfaa
1  sudhesh      65  bien    detail
2   manish      77  wien      onus
3   lovely       6   ABC  returned

## How to concat two dataframes in Pandas

In [5]:
display("concat df1 and df2 vertically", pd.concat([df1,df2]))
display("concat df1 and df2 horizontally", pd.concat([df1,df2], axis = 1))
display("concat df3 and df1 with uneven columns",pd.concat([df3,df1]))

df4 = pd.concat([df3,df1], axis =1)

df5 = df4.iloc[[1,3]]

display("display df4 selected rows and columns data where rows are sequential", df4.iloc[1:3, 1:3])
display("display df4 selected rows and columns data where rows are not sequential - way 1", df4.iloc[[1,3],5:])

display("display df4 selected rows and columns data where rows are not sequential - way 2", df5[['name','test','string']])

'concat df1 and df2 vertically'

       name  number  test    string
0   ineuron      12   xyz  dhjfbshj
1    ankita      55  bien     honey
2  abhishek      87  wien  regarder
3     raman      26   ABC  returned
0     surya      14   xyz  djkfdfaa
1   sudhesh      65  bien    detail
2    manish      77  wien      onus
3    lovely       6   ABC  returned

'concat df1 and df2 horizontally'

       name  number  test    string     name  number  test    string
0   ineuron      12   xyz  dhjfbshj    surya      14   xyz  djkfdfaa
1    ankita      55  bien     honey  sudhesh      65  bien    detail
2  abhishek      87  wien  regarder   manish      77  wien      onus
3     raman      26   ABC  returned   lovely       6   ABC  returned

'concat df3 and df1 with uneven columns'

         name  number    test    string
0   ineuron13      12   xyz13       NaN
1    ankita13      55  bien13       NaN
2  abhishek13      87  wien13       NaN
3     raman13      26   ABC13       NaN
0     ineuron      12     xyz  dhjfbshj
1      ankita      55    bien     honey
2    abhishek      87    wien  regarder
3       raman      26     ABC  returned

'display df4 selected rows and columns data where rows are sequential'

   number    test
1      55  bien13
2      87  wien13

'display df4 selected rows and columns data where rows are not sequential - way 1'

   test    string
1  bien     honey
3   ABC  returned

'display df4 selected rows and columns data where rows are not sequential - way 2'

       name    name    test  test    string
1  ankita13  ankita  bien13  bien     honey
3   raman13   raman   ABC13   ABC  returned

## How to merge two dataframes in Pandas

In [6]:
display("Merge operation based on column name, by default merge type is inner join", pd.merge(df1,df6, on = 'name'))
display("Merge operation based on column name, type is left join", pd.merge(df1,df6, on = 'name', how = "left"))
display("Merge operation based on column name, type is right join", pd.merge(df1,df6, on = 'name', how = "right"))
display("Merge operation based on column which is only in one dataframe", pd.merge(df1,df7, left_on = 'name',right_on = 'name1'))
display("Merge operation based on multiple columns", pd.merge(df1,df2, on = ['test', 'string']))

'Merge operation based on column name, by default merge type is inner join'

       name  number_x test_x  string_x  number_y test_y  string_y
0   ineuron        12    xyz  dhjfbshj        12    xyz  dhjfbshj
1  abhishek        87   wien  regarder        87   wien  regarder

'Merge operation based on column name, type is left join'

       name  number_x test_x  string_x  number_y test_y  string_y
0   ineuron        12    xyz  dhjfbshj      12.0    xyz  dhjfbshj
1    ankita        55   bien     honey       NaN    NaN       NaN
2  abhishek        87   wien  regarder      87.0   wien  regarder
3     raman        26    ABC  returned       NaN    NaN       NaN

'Merge operation based on column name, type is right join'

       name  number_x test_x  string_x  number_y test_y  string_y
0   ineuron      12.0    xyz  dhjfbshj        12    xyz  dhjfbshj
1    manish       NaN    NaN       NaN        66   bien     honey
2  abhishek      87.0   wien  regarder        87   wien  regarder
3    lovely       NaN    NaN       NaN        26    ABC  returned

'Merge operation based on column which is only in one dataframe'

       name  number_x test_x    string     name1  number_y  test_y
0   ineuron        12    xyz  dhjfbshj   ineuron        12   xyz13
1  abhishek        87   wien  regarder  abhishek        87  wien13

'Merge operation based on multiple columns'

  name_x  number_x test    string  name_y  number_y
0  raman        26  ABC  returned  lovely         6

In [14]:
display("join operation using default join method i.e left", df1.join(df8))
display("join operation using right join method", df1.join(df8, how = 'right'))
display("join operation using inner join method", df1.join(df8, how = 'inner'))
display("join operation using outer join method", df1.join(df8, how = 'outer'))

'join operation using default join method i.e left'

       name  number  test    string     name1  number1   test1
0   ineuron      12   xyz  dhjfbshj   ineuron       12   xyz13
1    ankita      55  bien     honey  ankita13       55  bien13
2  abhishek      87  wien  regarder  abhishek       87  wien13
3     raman      26   ABC  returned   raman13       26   ABC13

'join operation using right join method'

       name  number  test    string     name1  number1   test1
0   ineuron      12   xyz  dhjfbshj   ineuron       12   xyz13
1    ankita      55  bien     honey  ankita13       55  bien13
2  abhishek      87  wien  regarder  abhishek       87  wien13
3     raman      26   ABC  returned   raman13       26   ABC13

'join operation using inner join method'

       name  number  test    string     name1  number1   test1
0   ineuron      12   xyz  dhjfbshj   ineuron       12   xyz13
1    ankita      55  bien     honey  ankita13       55  bien13
2  abhishek      87  wien  regarder  abhishek       87  wien13
3     raman      26   ABC  returned   raman13       26   ABC13

'join operation using outer join method'

       name  number  test    string     name1  number1   test1
0   ineuron      12   xyz  dhjfbshj   ineuron       12   xyz13
1    ankita      55  bien     honey  ankita13       55  bien13
2  abhishek      87  wien  regarder  abhishek       87  wien13
3     raman      26   ABC  returned   raman13       26   ABC13

In [12]:
df1.join(df9)

       name  number  test    string name1  number1 test1
0   ineuron      12   xyz  dhjfbshj   NaN      NaN   NaN
1    ankita      55  bien     honey   NaN      NaN   NaN
2  abhishek      87  wien  regarder   NaN      NaN   NaN
3     raman      26   ABC  returned   NaN      NaN   NaN

#### Merge operation is performed based on column condition. Join method is used to merge based on index values of dataframe rows

## Pandas data manipulation examples

In [16]:
import numpy as np

In [20]:
data1 = {
    "col1": [1,2,3,5,6,7,0,3],
    "col2": [3,34,123,4564,234,235,78,908],
    "col3": "this is an example of pandas and numpy".split()
}

In [21]:
dataf1 = pd.DataFrame(data1)

### data input methods

In [34]:
dataf1['col4'] = 2*dataf1['col2']
dataf1['col5'] = np.log(dataf1['col2'])

def testdata(data):
    if data > 500:
        return np.log(data)
    else:
        return data/10

dataf1['col6'] = dataf1['col2'].apply(testdata)
dataf1['col7'] = dataf1['col3'].apply(len)

In [35]:
display("dataf1",  dataf1)

'dataf1'

   col1  col2     col3  col4      col5       col6  col7
0     1     3     this     6  1.098612   0.300000     4
1     2    34       is    68  3.526361   3.400000     2
2     3   123       an   246  4.812184  12.300000     2
3     5  4564  example  9128  8.425955   8.425955     7
4     6   234       of   468  5.455321  23.400000     2
5     7   235   pandas   470  5.459586  23.500000     6
6     0    78      and   156  4.356709   7.800000     3
7     3   908    numpy  1816  6.811244   6.811244     5

### data sort methods

In [39]:
display("data sorted by column 2 by default ascending is true", dataf1.sort_values(by = "col2"))
display("data sorted by column 2 descending", dataf1.sort_values(by = "col2", ascending = False))

'data sorted by column 2 by default ascending is true'

   col1  col2     col3  col4      col5       col6  col7
0     1     3     this     6  1.098612   0.300000     4
1     2    34       is    68  3.526361   3.400000     2
6     0    78      and   156  4.356709   7.800000     3
2     3   123       an   246  4.812184  12.300000     2
4     6   234       of   468  5.455321  23.400000     2
5     7   235   pandas   470  5.459586  23.500000     6
7     3   908    numpy  1816  6.811244   6.811244     5
3     5  4564  example  9128  8.425955   8.425955     7

'data sorted by column 2 descending'

   col1  col2     col3  col4      col5       col6  col7
3     5  4564  example  9128  8.425955   8.425955     7
7     3   908    numpy  1816  6.811244   6.811244     5
5     7   235   pandas   470  5.459586  23.500000     6
4     6   234       of   468  5.455321  23.400000     2
2     3   123       an   246  4.812184  12.300000     2
6     0    78      and   156  4.356709   7.800000     3
1     2    34       is    68  3.526361   3.400000     2
0     1     3     this     6  1.098612   0.300000     4

### lambda and map function

In [62]:
l = [1,2,3,4,5]
display("comprehension function -> [i+1 for i in l]", [i+1 for i in l])

def testAdd(data):
    return data+1

def testMathScenario(data):
    if data < 3:
        return np.sqrt(data)
    else:
        return np.log(data)

display("map function to increment the values in list -> list(map(testAdd,l)", list(map(testAdd,l)))
display("map function to perform math operations on list values -> list(map(testMathScenario,l)", 
        list(map(testMathScenario,l)))
display("map function to increment the values in list using lambda -> list(map(lambda data: data+1 ,l)", 
        list(map(lambda data: data+1 ,l)))
display("""map function to perform math operations on list values using lambda -> list(map(lambda data: np.sqrt(data) if data <3 else np.log(data),l)""", 
        list(map(lambda data: np.sqrt(data) if data <3 else np.log(data),l)))

'comprehension function -> [i+1 for i in l]'

[2, 3, 4, 5, 6]

'map function to increment the values in list -> list(map(testAdd,l)'

[2, 3, 4, 5, 6]

'map function to perform math operations on list values -> list(map(testMathScenario,l)'

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003]

'map function to increment the values in list using lambda -> list(map(lambda data: data+1 ,l)'

[2, 3, 4, 5, 6]

'map function to perform math operations on list values using lambda -> list(map(lambda data: np.sqrt(data) if data <3 else np.log(data),l)'

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003]

### reduce method

In [68]:
import functools

In [64]:
l1 = [4,5,6,7,7,8,8]

In [70]:
display(sum(l1))
display("get the sum using reduce method: ",functools.reduce(lambda x,y: x+y, l1))

45

'get the sum using reduce method: '

45

### filter function

In [77]:
l2 = [1,2,5,4,3,8,9,2,2,5,4,7,0,0]

display("filter even odd", list(filter(lambda x : True if x%2==0 else False ,l2)))

'filter even odd'

[2, 4, 8, 2, 2, 4, 0, 0]